/*******************************************************************************
                      版权所有 (C), 2017-,NCUROBOT
********************************************************************************
* 文 件 名   : protocol.c
* 版 本 号   : 初稿
* 作    者   : NCUERM
* 生成日期   : 2018年7月
* 最近修改   :
* 功能描述   : crc校验函数
* 函数列表   :		
*						  uint8_t verify_crc8_check_sum(uint8_t* pchMessage, uint16_t dwLength)
*						  uint8_t	append_crc8_check_sum(uint8_t* pchMessage, uint16_t dwLength)
*					    uint8_t verify_crc16_check_sum(uint8_t* pchMessage, uint32_t dwLength)
*						  uint16_t append_crc16_check_sum(uint8_t* pchMessage, uint32_t dwLength)
*
*******************************************************************************/

/* 包含头文件 ----------------------------------------------------------------*/
#include "protocol.h"
/* 内部自定义数据类型 --------------------------------------------------------*/
ROBOT Robot;
/* 内部宏定义 ----------------------------------------------------------------*/

/* 任务相关信息定义-----------------------------------------------------------*/

/* 内部常量定义---------------------------------------------------------------*/



